conf/src/Documents/ЭП_ВыплатыПремий/ЭП_ВыплатыПремий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭП_ВыплатыПремий</name>
  <registerRecords>AccumulationRegister.ЭП_УчетПремийПоДокументам</registerRecords>
  <registerRecords>AccumulationRegister.ЭП_УчетПремий</registerRecords>
  <registerRecords>AccumulationRegister.ЭП_ВыплатаПремий</registerRecords>
  <registerRecords>AccumulationRegister.ЭП_ВыплатыПремийПоСопровождению</registerRecords>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬЭтап</name>
    <type>
      <types>CatalogRef.РазделыПроекта</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.ЭП_СтатусыДокументаВыплатаПремии</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.ЭП_ВидыДокументаВыплатаПремий</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьМесяц</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидВыплаты</name>
    <type>
      <types>EnumRef.ЭП_ВидВыплатыПремии</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроектныйКоэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПремияПоЭтапу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроектнаяПремия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогСУчетомПроектногоКоэффициента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогБезУчетаПроектногоКоэффициента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СреднийКоэффициентПЗК</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОстатокПЗК</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.РазделыПроекта</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПоПроекту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТехническийПроект</name>
      <type>
        <types>CatalogRef.ТехническиеПроекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭП_КоэффициентБюджетаПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоказателиПремирования</name>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.РазделыПроекта</types>
      </type>
    </attributes>
    <attributes>
      <name>РеализацияАкт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоступлениеАкт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВаловаяПрибыль</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентБюджетаПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БюджетПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АктыРеализацииДляПремирования</name>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.РазделыПроекта</types>
      </type>
    </attributes>
    <attributes>
      <name>АктРеализация</name>
      <type>
        <types>DocumentRef.ЭП_РеализацияУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАкта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АктыПоступленияДляПремирования</name>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.РазделыПроекта</types>
      </type>
    </attributes>
    <attributes>
      <name>АктПоступление</name>
      <type>
        <types>DocumentRef.ЭП_ПоступлениеУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАкта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

conf/src/AccumulationRegisters/ЭП_Реализация/ЭП_Реализация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЭП_Реализация</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаАкта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолучен</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплачен</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>CatalogRef.РазделыПроекта</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

conf/src/AccumulationRegisters/ЭП_УчетПремий/ЭП_УчетПремий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЭП_УчетПремий</name>
  <resources>
    <name>ОстатокПЗК</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроектнаяПремия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПремияПоЭтапу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>CatalogRef.РазделыПроекта</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

conf/src/AccumulationRegisters/ЭП_УчетПремийПоДокументам/ЭП_УчетПремийПоДокументам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЭП_УчетПремийПоДокументам</name>
  <resources>
    <name>ОстатокПЗК</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроектнаяПремия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПремияПоЭтапу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УДАЛИТЬЭтап</name>
    <type>
      <types>CatalogRef.РазделыПроекта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТехническийПроект</name>
    <type>
      <types>CatalogRef.ТехническиеПроекты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

conf/src/Enums/ЭП_ВидыДокументаВыплатаПремий/ЭП_ВидыДокументаВыплатаПремий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЭП_ВидыДокументаВыплатаПремий</name>
  <enumValues>
    <name>ВыплатаПоСопровждению</name>
  </enumValues>
  <enumValues>
    <name>ОбычнаяВыплата</name>
  </enumValues>
</mdclass:Enum>

conf/src/Enums/СтатусыТехническихПроектов/СтатусыТехническихПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыТехническихПроектов</name>
  <enumValues>
    <name>НеЗапланирован</name>
  </enumValues>
  <enumValues>
    <name>Запланирован</name>
  </enumValues>
  <enumValues>
    <name>Активен</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

conf/src/Documents/ЭП_ВыплатыПремий/Forms/ФормаПодбораЭтапов/Module.bsl
#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Проект") Тогда
		Проект = Параметры.Проект; 
	КонецЕсли;
	ВидДокумента = Параметры.ВидДокумента;
	Если ВидДокумента = Перечисления.ЭП_ВидыДокументаВыплатаПремий.ВыплатаПоСопровждению Тогда
		Элементы.СписокЭтап.Заголовок = "ТехническийПроект";
		Элементы.ВыбранныеЭтапыЭтап.Заголовок = "ТехническийПроект";
		Элементы.ВыбранныеЭтапы.Заголовок = "Выбранные технические проекты";
	КонецЕсли;
	Если Параметры.Свойство("ВидВыплаты") Тогда
	
		ВидВыплаты = Параметры.ВидВыплаты;		
	
	КонецЕсли;
	Период = Параметры.Период;
	ОбновитьСписокВыбораЭтапов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы 

&НаКлиенте
Процедура ВыполненныеЭтапыПриИзменении(Элемент)
	
	ВыполненныеЭтапыПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	ВыделенныеСтроки = ВыбранныеЭтапы;
	РезультатВыбора = Новый Структура; 
    АдресВоВременномХранилище = ПоместитьВыбранныеЭтапыВоВременноеХранилище();
	РезультатВыбора.Вставить("АдресТаблицыЭтаповИАктов", АдресВоВременномХранилище);
	ОповеститьОВыборе(РезультатВыбора);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Функция ПоместитьВыбранныеЭтапыВоВременноеХранилище()

	ТаблицаЭтаповИАктов = ВыбранныеЭтапы.Выгрузить();   
	Возврат ПоместитьВоВременноеХранилище(ТаблицаЭтаповИАктов);	

КонецФункции

&НаСервере
Процедура ВыполненныеЭтапыПриИзмененииНаСервере()
	ОбновитьСписокВыбораЭтапов();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокВыбораЭтапов()
	 
	Если ВидДокумента = Перечисления.ЭП_ВидыДокументаВыплатаПремий.ОбычнаяВыплата Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭП_РеализацияОбороты.Этап КАК Этап,
		|	ЭП_РеализацияОбороты.Регистратор КАК Акт
		|ПОМЕСТИТЬ ВТ_ЭтапыСАктами
		|ИЗ
		|	РегистрНакопления.ЭП_Реализация.Обороты(, , Регистратор, НЕ Этап В (&МассивЭтапов)) КАК ЭП_РеализацияОбороты
		|ГДЕ
		|	ЭП_РеализацияОбороты.СуммаОборот > 0
		|	И НЕ ЭП_РеализацияОбороты.Регистратор В (&МассивАктов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЭП_УчетПремийОстатки.Этап КАК Этап,
		|	ВТ_ЭтапыСАктами.Акт КАК Акт
		|ПОМЕСТИТЬ ВТ_Этапы
		|ИЗ
		|	ВТ_ЭтапыСАктами КАК ВТ_ЭтапыСАктами
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЭП_УчетПремий.Остатки(
		|				КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ),
		|				Проект = &Проект
		|					И Этап В
		|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|							ВТ_ЭтапыСАктами.Этап КАК Этап
		|						ИЗ
		|							ВТ_ЭтапыСАктами КАК ВТ_ЭтапыСАктами)) КАК ЭП_УчетПремийОстатки
		|		ПО ВТ_ЭтапыСАктами.Этап = ЭП_УчетПремийОстатки.Этап
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Этапы.Этап КАК Этап,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТехническиеПроекты.Ссылка) КАК КоличествоВсего,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТехническиеПроектыЗакрытые.Ссылка) КАК КоличествоЗакрытых,
		|	ВТ_Этапы.Акт КАК Акт
		|ПОМЕСТИТЬ ВТ_КоличествоТехПроектов
		|ИЗ
		|	ВТ_Этапы КАК ВТ_Этапы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТехническиеПроекты КАК ТехническиеПроекты
		|		ПО (ВТ_Этапы.Этап = ТехническиеПроекты.РазделПроекта
		|				ИЛИ ВТ_Этапы.Этап = ТехническиеПроекты.РазделыПроекта.Раздел)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТехническиеПроекты КАК ТехническиеПроектыЗакрытые
		|		ПО (ВТ_Этапы.Этап = ТехническиеПроектыЗакрытые.РазделПроекта
		|				ИЛИ ВТ_Этапы.Этап = ТехническиеПроектыЗакрытые.РазделыПроекта.Раздел)
		|			И (ТехническиеПроектыЗакрытые.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыТехническихПроектов.Выполнен), ЗНАЧЕНИЕ(Перечисление.СтатусыТехническихПроектов.Отменен)))
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Этапы.Этап,
		|	ВТ_Этапы.Акт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КоличествоТехПроектов.Этап КАК Этап,
		|	ВЫБОР
		|		КОГДА ВТ_КоличествоТехПроектов.КоличествоВсего = ВТ_КоличествоТехПроектов.КоличествоЗакрытых
		|			ТОГДА ""Закрыт""
		|		ИНАЧЕ ""Не закрыт""
		|	КОНЕЦ КАК Статус,
		|	ВТ_КоличествоТехПроектов.Акт КАК Акт
		|ИЗ
		|	ВТ_КоличествоТехПроектов КАК ВТ_КоличествоТехПроектов";
		
		
	Иначе
	    Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЭП_РеализацияОбороты.Этап КАК Этап,
		|	ЭП_РеализацияОбороты.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВТ_ЭтапыСАктами
		|ИЗ
		|	РегистрНакопления.ЭП_Реализация.Обороты(, , Регистратор, Проект = &Проект) КАК ЭП_РеализацияОбороты
		|ГДЕ
		|	НЕ ЭП_РеализацияОбороты.Регистратор В (&МассивАктов)
		|	И ЭП_РеализацияОбороты.СуммаОборот > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЭП_УчетПремийПоДокументамОстатки.ТехническийПроект КАК Этап,
		|	ЭП_УчетПремийПоДокументамОстатки.ТехническийПроект.Статус КАК Статус,
		|	ВТ_ЭтапыСАктами.Регистратор КАК Акт
		|ИЗ
		|	ВТ_ЭтапыСАктами КАК ВТ_ЭтапыСАктами
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЭП_УчетПремийПоДокументам.Остатки(
		|				КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ),
		|				Проект = &Проект
		|					И НЕ ТехническийПроект В (&МассивЭтапов)) КАК ЭП_УчетПремийПоДокументамОстатки
		|		ПО ВТ_ЭтапыСАктами.Регистратор = ЭП_УчетПремийПоДокументамОстатки.ТехническийПроект.ЭП_РеализацияУслуг
		|ГДЕ
		|	ЭП_УчетПремийПоДокументамОстатки.ТехническийПроект.ЭП_РеализацияУслуг.Этап В
		|			(ВЫБРАТЬ
		|				ВТ_ЭтапыСАктами.Этап КАК Этап
		|			ИЗ
		|				ВТ_ЭтапыСАктами КАК ВТ_ЭтапыСАктами)";
		
	КонецЕсли;
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыТехническихПроектов.Выполнен);
	Запрос.УстановитьПараметр("Дата", Период);
	Запрос.УстановитьПараметр("МассивЭтапов", ВыбранныеЭтапы.Выгрузить(,"Этап"));  
	Запрос.УстановитьПараметр("МассивАктов", ВыбранныеЭтапы.Выгрузить(,"Акт"));
    Список.Загрузить(Запрос.Выполнить().Выгрузить());
	

КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Для Каждого Строка Из ВыбраннаяСтрока Цикл
		НоваяСтрока = ВыбранныеЭтапы.Добавить();
		НоваяСтрока.Этап = Элементы.Список.ДанныеСтроки(Строка).Этап; 
		НоваяСтрока.Акт = Элементы.Список.ДанныеСтроки(Строка).Акт; 
	КонецЦикла;
	
	ОбновитьСписокВыбораЭтапов();
КонецПроцедуры  

&НаКлиенте
Процедура ВыбранныеЭтапыПриИзменении(Элемент)
	ОбновитьСписокВыбораЭтапов();
КонецПроцедуры

#КонецОбласти
